# pandas 数据聚合与分组运算

In [8]:
import pandas as pd
import numpy as  np
from pandas import Series,DataFrame
from numpy import reshape

In [9]:
df = pd.DataFrame([('bird', 'Falconiformes', 389.0),
   ...:                    ('bird', 'Psittaciformes', 24.0),
   ...:                    ('mammal', 'Carnivora', 80.2),
   ...:                    ('mammal', 'Primates', np.nan),
   ...:                    ('mammal', 'Carnivora', 58)],
   ...:                   index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'],
   ...:                   columns=('class', 'order', 'max_speed'))
df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [10]:
#groupby产生的是一个对象DataFrameGroupBy，实际上还没有进行任何计算；
#根据分组键进行聚合（sum,count,mean等）后，产生了一个新的Series,
grouped=df.groupby('class')
grouped

In [11]:
grouped.mean()

        max_speed
class
bird        206.5
mammal       69.1

In [12]:
grouped=df.groupby('order',axis='columns')

In [13]:
grouped=df.groupby(['class','order'])

In [14]:
grouped.count()

                       max_speed
class  order
bird   Falconiformes           1
       Psittaciformes          1
mammal Carnivora               2
       Primates                0

In [15]:
grouped.sum()

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora           138.2
       Primates              0.0

In [16]:
grouped.mean()

                       max_speed
class  order
bird   Falconiformes       389.0
       Psittaciformes       24.0
mammal Carnivora            69.1
       Primates              NaN

In [17]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ...:                          'foo', 'bar', 'foo', 'foo'],
   ...:                    'B': ['one', 'one', 'two', 'three',
   ...:                          'two', 'two', 'one', 'three'],
   ...:                    'C': np.random.randn(8),
   ...:                    'D': np.random.randn(8)})

In [18]:
df

     A      B         C         D
0  foo    one  0.958310  0.205646
1  bar    one -0.133473  0.454790
2  foo    two  2.517478 -0.540822
3  bar  three  0.174258 -0.801833
4  foo    two  0.365076 -0.009599
5  bar    two  1.435854  1.003331
6  foo    one -2.463708 -0.418427
7  foo  three  0.287399  0.294082

In [19]:
grouped = df.groupby('A')

In [20]:
grouped.sum()

            C         D
A
bar  1.476639  0.656288
foo  1.664555 -0.469120

In [21]:
grouped.mean()

            C         D
A
bar  0.492213  0.218763
foo  0.332911 -0.093824

In [22]:
grouped = df.groupby(['A', 'B'])

In [23]:
grouped.sum()

                  C         D
A   B
bar one   -0.133473  0.454790
    three  0.174258 -0.801833
    two    1.435854  1.003331
foo one   -1.505399 -0.212781
    three  0.287399  0.294082
    two    2.882554 -0.550421

In [24]:
grouped.mean()

                  C         D
A   B
bar one   -0.133473  0.454790
    three  0.174258 -0.801833
    two    1.435854  1.003331
foo one   -0.752699 -0.106391
    three  0.287399  0.294082
    two    1.441277 -0.275210

In [25]:
lst = [1,2,3,4,5,1,2,3,'a']
lst

[1, 2, 3, 4, 5, 1, 2, 3, 'a']

In [26]:
s = pd.Series([1,2,3,4,5,10,20,30,40],lst)
s

1     1
2     2
3     3
4     4
5     5
1    10
2    20
3    30
a    40
dtype: int64

In [27]:
grouped=s.groupby(level=0)

In [28]:
#first()
grouped.first()

1     1
2     2
3     3
4     4
5     5
a    40
dtype: int64

In [29]:
#last()
grouped.last()

1    10
2    20
3    30
4     4
5     5
a    40
dtype: int64

In [30]:
grouped.sum()

1    11
2    22
3    33
4     4
5     5
a    40
dtype: int64

# GroupBy sorting排序
+ 默认情况下，在groupby操作过程中对键进行排序。sort=False倒序

In [31]:
df2 = pd.DataFrame({'X':['B','B','A','A','C'],'Y':[1,2,3,4,4]})
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4
4  C  4

In [32]:
df2.groupby(['X']).sum()#sort=False倒序，不填默认是顺序

   Y
X
A  7
B  3
C  4

In [33]:
df2.groupby(['X'],sort=False).sum() #sort=False倒序，不填默认是顺序

   Y
X
B  3
A  7
C  4

In [34]:
df2.groupby(['Y']).count() #count()计数，字符串不能参与运算，但可以计数

   X
Y
1  1
2  1
3  1
4  2

In [35]:
df2.groupby(['Y']).count()

   X
Y
1  1
2  1
3  1
4  2

In [36]:
df2.groupby(['X']).get_group('A') #按X分组并取出A

   X  Y
2  A  3
3  A  4

In [37]:
df2.groupby(['X']).get_group('B')#按X分组并取出B

   X  Y
0  B  1
1  B  2

In [38]:
df2.groupby(['Y']).get_group(4)#按Y分组并取出“4”

   X  Y
3  A  4
4  C  4

# GroupBy object attributes对象属性
+ groupby之后成为dict字典，通过groups可显示其属性；其键是计算出的唯一组，而对应的值是属于每个组的轴标签。
+ len在GroupBy对象上调用标准Python 函数只是返回groups字典的长度

In [39]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ...:                          'foo', 'bar', 'foo', 'foo'],
   ...:                    'B': ['one', 'one', 'two', 'three',
   ...:                          'two', 'two', 'one', 'three'],
   ...:                    'C': np.random.randn(8),
   ...:                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.125592 -0.021361
1  bar    one -0.686533  0.448176
2  foo    two  0.012409 -1.255875
3  bar  three  0.207402 -0.309512
4  foo    two -1.448738  0.090902
5  bar    two  0.557545 -0.210345
6  foo    one  0.210430  0.517356
7  foo  three  0.138408  0.312287

In [40]:
 df.groupby('A').groups #显示groupby字典属性

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [41]:
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4
4  C  4

In [42]:
 df2.groupby('X').groups #显示groupby字典属性

{'A': Int64Index([2, 3], dtype='int64'),
 'B': Int64Index([0, 1], dtype='int64'),
 'C': Int64Index([4], dtype='int64')}

In [43]:
grouped = df.groupby(['A', 'B'])
grouped.groups

{('bar', 'one'): Int64Index([1], dtype='int64'),
 ('bar', 'three'): Int64Index([3], dtype='int64'),
 ('bar', 'two'): Int64Index([5], dtype='int64'),
 ('foo', 'one'): Int64Index([0, 6], dtype='int64'),
 ('foo', 'three'): Int64Index([7], dtype='int64'),
 ('foo', 'two'): Int64Index([2, 4], dtype='int64')}

In [44]:
len(grouped) #len计算groupby后的字典长度

6

# GroupBy with MultiIndex，用的GroupBy多指标
+ 指定索引名进行groupby

In [45]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
   ....:           ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [46]:
index = pd.MultiIndex.from_arrays(arrays, names=['firsta', 'secondb'])
s = pd.Series(np.random.randn(8), index=index)

In [47]:
s

firsta  secondb
bar     one       -0.030936
        two        1.464740
baz     one        0.976463
        two       -1.805615
foo     one        0.283779
        two       -1.436975
qux     one       -0.345226
        two       -0.129922
dtype: float64

In [48]:
s.groupby(level=0).sum()#按第一层索引groupby

firsta
bar    1.433804
baz   -0.829152
foo   -1.153196
qux   -0.475148
dtype: float64

In [49]:
s.groupby(level='secondb').sum() #按第二层索引groupby,索引名为secondb

secondb
one    0.884081
two   -1.907771
dtype: float64

In [50]:
 s.sum(level='secondb') # 相当于s.groupby(level='secondb').sum()

secondb
one    0.884081
two   -1.907771
dtype: float64

In [51]:
 s.groupby(level=['firsta', 'secondb']).sum() #同时按第一层和第二层索引groupby,索引名分布为firsta,secondb

firsta  secondb
bar     one       -0.030936
        two        1.464740
baz     one        0.976463
        two       -1.805615
foo     one        0.283779
        two       -1.436975
qux     one       -0.345226
        two       -0.129922
dtype: float64

In [52]:
s.groupby(['firsta', 'secondb']).sum() #相当于 s.groupby(level=['firsta', 'secondb']).sum()

firsta  secondb
bar     one       -0.030936
        two        1.464740
baz     one        0.976463
        two       -1.805615
foo     one        0.283779
        two       -1.436975
qux     one       -0.345226
        two       -0.129922
dtype: float64

# 用索引级别和列对DataFrame进行分组

In [53]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
   ....:           ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [54]:
index = pd.MultiIndex.from_arrays(arrays, names=['firsta', 'secondb'])

In [55]:
df = pd.DataFrame({'A': [1, 1, 1, 1, 2, 2, 3, 3],
   ....:                    'B': np.arange(8)},
   ....:                   index=index)
df

                A  B
firsta secondb
bar    one      1  0
       two      1  1
baz    one      1  2
       two      1  3
foo    one      2  4
       two      2  5
qux    one      3  6
       two      3  7

In [56]:
 df.groupby([pd.Grouper(level=0), 'A']).sum() #按第一索引和A列 groupby

           B
firsta A
bar    1   1
baz    1   5
foo    2   9
qux    3  13

In [57]:
df.groupby([pd.Grouper(level='firsta'), 'A']).sum()#按索引名为‘firsta’和A列 groupby，,效果同上一脚本

           B
firsta A
bar    1   1
baz    1   5
foo    2   9
qux    3  13

In [58]:
 df.groupby([pd.Grouper(level=1), 'B']).sum()#按第二索引和B列 groupby

           A
secondb B
one     0  1
        2  1
        4  2
        6  3
two     1  1
        3  1
        5  2
        7  3

In [59]:
df.groupby([pd.Grouper(level='secondb'), 'B']).sum()#按索引名为‘secondb’和B列 groupby,效果同上一脚本

           A
secondb B
one     0  1
        2  1
        4  2
        6  3
two     1  1
        3  1
        5  2
        7  3

In [60]:
 df.groupby(['secondb', 'B']).sum() ##按索引名为‘secondb’和B列 groupby,效果同上一脚本

           A
secondb B
one     0  1
        2  1
        4  2
        6  3
two     1  1
        3  1
        5  2
        7  3

# GroupBy中的DataFrame列选择Iterating through groups

In [61]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ...:                          'foo', 'bar', 'foo', 'foo'],
   ...:                    'B': ['one', 'one', 'two', 'three',
   ...:                          'two', 'two', 'one', 'three'],
   ...:                    'C': np.random.randn(8),
   ...:                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.868637 -0.356680
1  bar    one  1.150759  0.941184
2  foo    two  0.486890 -1.190075
3  bar  three  1.662304  0.981859
4  foo    two  0.923766  1.692661
5  bar    two -0.206594  0.006057
6  foo    one -0.547735 -1.425690
7  foo  three -0.744479 -1.085031

In [62]:
 df['C'].groupby(df['A']).sum()

A
bar    2.606468
foo    0.987079
Name: C, dtype: float64

In [63]:
df['A']

0    foo
1    bar
2    foo
3    bar
4    foo
5    bar
6    foo
7    foo
Name: A, dtype: object

In [64]:
df['D']

0   -0.356680
1    0.941184
2   -1.190075
3    0.981859
4    1.692661
5    0.006057
6   -1.425690
7   -1.085031
Name: D, dtype: float64

# 遍历组Iterating through groups,选择组get_group

In [65]:
for name,group in grouped:
    print(name)
    print(group)

('bar', 'one')
     A    B         C         D
1  bar  one -0.686533  0.448176
('bar', 'three')
     A      B         C         D
3  bar  three  0.207402 -0.309512
('bar', 'two')
     A    B         C         D
5  bar  two  0.557545 -0.210345
('foo', 'one')
     A    B         C         D
0  foo  one -1.125592 -0.021361
6  foo  one  0.210430  0.517356
('foo', 'three')
     A      B         C         D
7  foo  three  0.138408  0.312287
('foo', 'two')
     A    B         C         D
2  foo  two  0.012409 -1.255875
4  foo  two -1.448738  0.090902

In [69]:
df.groupby('A').get_group('bar')

     A      B         C         D
1  bar    one  1.150759  0.941184
3  bar  three  1.662304  0.981859
5  bar    two -0.206594  0.006057

# 聚合运算，常用函数
### 是减小返回对象尺寸的函数。下面列出了一些常用的汇总功能：

功能	描述
+ mean()	计算组的平均值
+ sum()	计算组值之和
+ size()	计算组大小
+ count()	计算组数
+ std()	组的标准偏差
+ var()	计算组的方差
+ sem()	均值的标准误
+ describe()	生成描述性统计
+ first()	首先计算组值
+ last()	计算组值的最后一个
+ nth()	取第n个值，如果n是一个列表，则取一个子集
+ min()	计算组值的最小值
+ max()	计算组值的最大值

In [67]:
df

     A      B         C         D
0  foo    one  0.868637 -0.356680
1  bar    one  1.150759  0.941184
2  foo    two  0.486890 -1.190075
3  bar  three  1.662304  0.981859
4  foo    two  0.923766  1.692661
5  bar    two -0.206594  0.006057
6  foo    one -0.547735 -1.425690
7  foo  three -0.744479 -1.085031

In [278]:
grouped=df.groupby('A')

In [279]:
grouped.aggregate(np.sum)

            C         D
A
bar -1.488149 -0.373063
foo  0.629790 -4.528341

In [280]:
grouped.sum()

            C         D
A
bar -1.488149 -0.373063
foo  0.629790 -4.528341

In [281]:
#您可以使用reset_indexDataFrame函数获得与列名称存储在结果中相同的结果MultiIndex：
df.groupby(['A', 'B']).sum().reset_index()

     A      B         C         D
0  bar    one -0.989770 -1.007015
1  bar  three -1.092751  0.849254
2  bar    two  0.594373 -0.215303
3  foo    one  0.692153 -2.082480
4  foo  three -0.372625 -0.832430
5  foo    two  0.310262 -1.613431

In [282]:
#另一个简单的聚合示例是计算每个组的大小。这作为size方法包含在GroupBy中。它返回一个Series，其索引是组名，其值是每个组的大小。
grouped.size()

A
bar    3
foo    5
dtype: int64

In [284]:
#过分组，Series您还可以传递要进行聚合的函数列表或字典，输出DataFrame
grouped['C'].agg([np.sum, np.mean, np.std]) #取grouped中的C列，再聚合运算

          sum      mean       std
A
bar -1.488149 -0.496050  0.945736
foo  0.629790  0.125958  1.045197

In [287]:
#agg组合运算
df.groupby('A').agg([np.sum, np.mean, np.std])#df按A列group,然后所有列参与聚合计算

            C                             D
          sum      mean       std       sum      mean       std
A
bar -1.488149 -0.496050  0.945736 -0.373063 -0.124354  0.931471
foo  0.629790  0.125958  1.045197 -4.528341 -0.905668  0.340791

In [296]:
grouped['C'].agg(lambda x: x.max() - x.min()) #C列参与运算

A
bar    1.687124
foo    2.708369
Name: C, dtype: float64

In [70]:
grouped['D'].agg(lambda x: x.median() - x.mean()) #D列参与运算

A    B
bar  one      0.0
     three    0.0
     two      0.0
foo  one      0.0
     three    0.0
     two      0.0
Name: D, dtype: float64

In [71]:
#C,D两列进行不同的运算方法
grouped.agg({'C': np.sum, 'D': lambda x: np.std(x, ddof=1)})

                  C         D
A   B
bar one   -0.686533       NaN
    three  0.207402       NaN
    two    0.557545       NaN
foo one   -0.915162  0.380931
    three  0.138408       NaN
    two   -1.436329  0.952315

In [72]:
grouped.agg({'C': 'sum', 'D': 'std'})

                  C         D
A   B
bar one   -0.686533       NaN
    three  0.207402       NaN
    two    0.557545       NaN
foo one   -0.915162  0.380931
    three  0.138408       NaN
    two   -1.436329  0.952315

# 重命名运算结果列的名称

In [82]:

animals = pd.DataFrame({'kind': ['cat','dog','cat','dog'], 'height': [9.1, 6.0, 9.5, 34.0], 'weight': [7.9, 7.5, 9.9, 198.0]})
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [81]:
animals.groupby("kind").agg(
   ....:     min_height=pd.NamedAgg(column='height', aggfunc='min'),
   ....:     max_height=pd.NamedAgg(column='height', aggfunc='max'),
   ....:     average_weight=pd.NamedAgg(column='weight', aggfunc=np.mean))

      min_height  max_height  average_weight
kind
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [83]:
animals.groupby("kind").agg(
   ....:     min_height=('height', 'min'),
   ....:     max_height=('height', 'max'),
   ....:     average_weight=('weight', np.mean)
   ....: )

      min_height  max_height  average_weight
kind
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

# 过滤

In [91]:
sf = pd.DataFrame([1, 1, 2, 3, 3, 3],index=list('abcdef'))
sf

   0
a  1
b  1
c  2
d  3
e  3
f  3

In [96]:
sf.groupby(level=0).filter(lambda x:x.sum()>2)

   0
d  3
e  3
f  3

In [102]:
dff = pd.DataFrame({'A': np.arange(8), 'B': list('aabbbbac')})
dff

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  b
5  5  b
6  6  a
7  7  c

In [103]:
dff.groupby('B').sum()

    A
B
a   7
b  14
c   7

In [108]:
#过滤出只有几个成员的组中的元素。
dff.groupby('B').filter(lambda x: len(x) > 2) # 按B列分组后，列表>2的分组

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  b
5  5  b
6  6  a

In [113]:
#未通过过滤器的组将填充NaN，而不是删除有问题的组。
dff.groupby('B').filter(lambda x: len(x) > 3, dropna=False)#不符合列表>2的分组，填充dropna=False

     A    B
0  NaN  NaN
1  NaN  NaN
2  2.0    b
3  3.0    b
4  4.0    b
5  5.0    b
6  NaN  NaN
7  NaN  NaN

In [116]:
dff['C'] = np.arange(8)  #增加一列C，由1-8填充
dff

   A  B  C
0  0  a  0
1  1  a  1
2  2  b  2
3  3  b  3
4  4  b  4
5  5  b  5
6  6  a  6
7  7  c  7

In [117]:
dff.groupby('B').filter(lambda x: len(x['C']) > 2)

   A  B  C
0  0  a  0
1  1  a  1
2  2  b  2
3  3  b  3
4  4  b  4
5  5  b  5
6  6  a  6